### using apply() method when `vectorization` is better option

In [1]:
import pandas as pd

In [2]:
# dictionary data

data = {
    'Year': [2091, 2092, 2093, 2094, 2095],
    'Time': [11.49, 08.61, 11.49, 09.64, 13.65],
    'Athlete': ['Shelly-Ann Fraser-Pryce', 'Elaine Thompson-Herah', 'Florence Griffith-Joyner', 'Carmelita Jeter', 'Marion Jones'],
    'Place': ['Jamaica', 'Jamaica', 'United States', 'United States', 'United States']
}

In [3]:
# Creating the dataframe using dictionary data

df = pd.DataFrame(data)

In [4]:
df

   Year   Time                   Athlete          Place
0  2091  11.49   Shelly-Ann Fraser-Pryce        Jamaica
1  2092   8.61     Elaine Thompson-Herah        Jamaica
2  2093  11.49  Florence Griffith-Joyner  United States
3  2094   9.64           Carmelita Jeter  United States
4  2095  13.65              Marion Jones  United States

### `Good way: using vectorization way`

In [6]:
df['Time_Doubled'] = df['Time'] ** 2

In [7]:
df

   Year   Time                   Athlete          Place  Time_Doubled
0  2091  11.49   Shelly-Ann Fraser-Pryce        Jamaica      132.0201
1  2092   8.61     Elaine Thompson-Herah        Jamaica       74.1321
2  2093  11.49  Florence Griffith-Joyner  United States      132.0201
3  2094   9.64           Carmelita Jeter  United States       92.9296
4  2095  13.65              Marion Jones  United States      186.3225

### `Alternative way: using apply() method`

In [8]:
df['Time_Doubled'] = df.apply(lambda row: row['Time'] ** 2, axis=1)

In [9]:
df

   Year   Time                   Athlete          Place  Time_Doubled
0  2091  11.49   Shelly-Ann Fraser-Pryce        Jamaica      132.0201
1  2092   8.61     Elaine Thompson-Herah        Jamaica       74.1321
2  2093  11.49  Florence Griffith-Joyner  United States      132.0201
3  2094   9.64           Carmelita Jeter  United States       92.9296
4  2095  13.65              Marion Jones  United States      186.3225